; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	thermograph5 - mode
	thermograph3 - mode
	spectrograph1 - mode
	spectrograph6 - mode
	image2 - mode
	thermograph4 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Star3 - direction
	Star1 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 spectrograph6)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument3 image2)
	(calibration_target instrument3 Star3)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument4 thermograph5)
	(calibration_target instrument4 Star3)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 Star1)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
)
(:goal (and
	(pointing satellite3 Star3)
	(have_image Planet5 thermograph3)
	(have_image Phenomenon6 thermograph3)
	(have_image Star7 thermograph5)
	(have_image Star7 spectrograph1)
	(have_image Planet8 image2)
	(have_image Planet9 thermograph3)
	(have_image Star10 spectrograph6)
	(have_image Phenomenon11 thermograph5)
	(have_image Phenomenon11 image2)
))

)

; plan
1. (turn_to satellite3 star3 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 star3)
   goals met: 1 of 10
2. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 1 of 10
3. (calibrate satellite3 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 1 of 10
4. (turn_to satellite3 phenomenon11 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 phenomenon11)
   goals met: 0 of 10
5. (turn_to satellite2 star3 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star3)
   goals met: 0 of 10
6. (turn_to satellite0 star3 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star3)
   goals met: 0 of 10
7. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 10
8. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 10
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
10. (calibrate satellite2 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 0 of 10
11. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 10
12. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 10
13. (take_image satellite3 phenomenon11 instrument4 thermograph5)
   added: (have_image phenomenon11 thermograph5)
   goals met: 1 of 10
14. (turn_to satellite0 phenomenon6 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon6)
   goals met: 1 of 10
15. (take_image satellite0 phenomenon6 instrument0 thermograph3)
   added: (have_image phenomenon6 thermograph3)
   goals met: 2 of 10
16. (turn_to satellite0 planet5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet5)
   goals met: 2 of 10
17. (take_image satellite0 planet5 instrument0 thermograph3)
   added: (have_image planet5 thermograph3)
   goals met: 3 of 10
18. (turn_to satellite0 planet9 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet9)
   goals met: 3 of 10
19. (take_image satellite0 planet9 instrument0 thermograph3)
   added: (have_image planet9 thermograph3)
   goals met: 4 of 10
20. (turn_to satellite0 star7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star7)
   goals met: 4 of 10
21. (take_image satellite0 star7 instrument0 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 5 of 10
22. (turn_to satellite1 star10 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star10)
   goals met: 5 of 10
23. (take_image satellite1 star10 instrument2 spectrograph6)
   added: (have_image star10 spectrograph6)
   goals met: 6 of 10
24. (turn_to satellite2 phenomenon11 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon11)
   goals met: 6 of 10
25. (take_image satellite2 phenomenon11 instrument3 image2)
   added: (have_image phenomenon11 image2)
   goals met: 7 of 10
26. (turn_to satellite2 planet8 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 planet8)
   goals met: 7 of 10
27. (take_image satellite2 planet8 instrument3 image2)
   added: (have_image planet8 image2)
   goals met: 8 of 10
28. (turn_to satellite3 star7 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 star7)
   goals met: 8 of 10
29. (take_image satellite3 star7 instrument4 thermograph5)
   added: (have_image star7 thermograph5)
   goals met: 9 of 10
30. (turn_to satellite3 star3 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 star3)
   goals met: 10 of 10
